360PB/RuView/firmware/esp32-csi-node/sdkconfig.defaults.spiram
# ESP32-S3 CSI Node — SDK Configuration with SPIRAM (PSRAM) Enabled
# Target: ESP32-S3 with 8MB Flash + 8MB Octal PSRAM

CONFIG_IDF_TARGET="esp32s3"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_display.csv"

# Flash: 8MB Quad SPI
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# === SPIRAM (PSRAM) Configuration ===
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MEMTEST=y

# Allow .bss segment to be placed in external memory
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# CSI enabled
CONFIG_ESP_WIFI_CSI_ENABLED=y

# NVS encryption disabled
# CONFIG_NVS_ENCRYPTION is not set

# Log levels
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# LWIP
CONFIG_LWIP_SO_RCVBUF=y

# FreeRTOS stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# WiFi IRAM optimization
CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=y
